#upload
alerta.tamanhoMaxImagem = O tamanho m\u00e1ximo suportado \u00e9 de at\u00e9 2mb.
alerta.tipoImagemNaoSuportado = Somente estes tipos s\u00e3o suportados. (.JPEG,.JPG ou .PNG)
alerta.tipoArquivoInvalido = Tipo de arquivo inv\u00e1lido.

#operador
operador.sucesso.salvo = Operador \"{0}\" salvo com sucesso.
operador.sucesso.excluir = Operador \"{0}\" exclu\u00eddo com sucesso. 
operador.sucesso.buscar = Operador encontrado com sucesso.
operador.sucesso.listar = Operadores listado com sucesso.
operador.sucesso.atualizar = Operador atualizado com sucesso.
operador.sucesso.salvoSemEvioEmail = {0} cadastrado com sucesso, por\u00e9m n\u00e3o foi poss\u00edvel enviar o e-mail de confirma\u00e7\u00e3o. A senha dever\u00e1 ser cadastrada diretamente na p\u00e1gina do operador.

operador.erro.salvar = N\u00e3o foi poss\u00edvel salvar o operador {0}.
operador.erro.excluir = N\u00e3o foi poss\u00edvel excluir o operador. 
operador.erro.atualizar = Erro ao atualizar o operador.
operador.erro.listar = Erro ao listar os operadores.

operador.alerta.max.size = O nome excede 40 caracteres!
operador.alerta.nome.obrigatorio = O nome do operador \u00e9 obrigat\u00f3rio!
operador.alerta.possui.registros = N\u00e3o foi poss\u00edvel excluir o operador {0} , pois j\u00e1 existe registros nos sistema!
operador.alerta.nomeInvalido = Nome de usu\u00e1rio ou identificador inv\u00e1lido.
operador.alerta.naocad = Operador n\u00e3o cadastrado.
operador.alerta.jacad = J\u00e1 existe um operador com esse usu\u00e1rio!
operador.alerta.id.nome.null = \u00c9 necess\u00e1rio o identificador do operador para realizar a opera\u00e7\u00e3o!
operador.alerta.admemin.naomudar = Esta opera\u00e7\u00e3o n\u00e3o \u00e9 poss\u00edvel para o operador administrador!
operador.alerta.grupoAdmin = O grupo de acesso do administrador n\u00e3o pode ser alterado!
operador.alerta.trocaSenha = A sua senha deve ser alterada
operador.alerta.trocaSenha.expirada = Sua senha expirou. Necess\u00e1rio cadastrar uma nova senha.
operador.alerta.naoEncontrador = O operador n\u00e3o encontrado!
operador.alerta.maxTentativas = O n\u00famero m\u00e1ximo de tentativas de login foi atingido e sua conta foi bloqueada. Entre em contato com o administrador do sistema ou utilize a recupera\u00e7\u00e3o de senha.
operador.alerta.maxTentativasTempo N\u00famero m\u00e1ximo de tentativas de login! Sua conta esta temporariamente bloqueada.Tente novamente em {0} hora ou entre e contato com o administrador do sistema.
operador.alerta.senhaInvalida = Usu\u00e1rio ou senha inv\u00e1lida.
operador.alerta.bloqueado = Sua conta est\u00e1 temporariamente desativada. Entre em contato com o administrador do sistema! 
operador.alerta.alterarPemissoes = N\u00e3o \u00e9 poss\u00edvel alterar as permiss\u00f5es do operador administrador!
operador.alerta.adminBloq = O operador administrado n\u00e3o pode ser bloqueado!
operador.alerta.senhaBloq = Sua conta est\u00e1 temporariamente bloqueada. Entre em contato com o administrador do sistema ou utilize a op\u00e7\u00e3o para recupera\u00e7\u00e3o da senha.
operador.alerta.alterarId = O identificador n\u00e3o poder ser alterado para outro usu\u00e1rio! Voc\u00ea deve realizar uma atualiza\u00e7\u00e3o do usu\u00e1rio com o respectivo identificador. 
operador.alerta.senhaAtualNaoConfere = A senha atual est\u00e1 incorreta!
operador.alerta.funcionario = N\u00e3o \u00e9 poss\u00edvel excluir este operador, pois est\u00e1 vinculado a um funcion\u00e1rio.
operador.alerta.codigoInvalido = C\u00f3digo de verifica\u00e7\u00e3o inv\u00e1lido
operador.alerta.recuperacaoSenha = E-mail enviado com sucesso.
#operador.alerta.emailJaCad = J\u00e1 existe um usu\u00e1rio cadastrado com o E-mail
operador.alerta.emailJaCad = E-mail j\u00e1 cadastrado!
operador.alerta.emailInvalido = O endere\u00e7o de E-mail \u00e9 inv\u00e1lido!
operador.alerta.emailNaoCadastrado = E-mail n\u00e3o cadastrado.
operador.alerta.senhaAlteradaMesmaAtual = Esta senha n\u00e3o pode ser utilizada pois \u00e9 a mesma da atual. 
operador.alerta.emailnaoEnviado = N\u00e3o foi poss\u00edvel enviar o e-mail.
operador.alerta.admin.naomudar = N\u00e3o \u00e9 permitido esta a\u00e7\u00e3o para o operador administrador!
operador.alerta.naoCadastrado = Operador n\u00e3o cadastrado.
operador.alerta.usoSistema = Este operador n\u00e3o pode ser cadastrado, pois \u00e9 utilizado internamente pelo sistema!

seguranca.alerta.complexSenha = A senha deve conter letras e n\u00fameros.
seguranca.alerta.minSenha = A senha deve conter no m\u00ednimo {0} caracteres. 
seguranca.alerta.senhaRecente = Esta senha j\u00e1 foi utilizada recentemente.
seguranca.validacao.seguranca = Erro ao realizar a valida\u00e7\u00e3o de seguran\u00e7a.
seguranca.configuracao.valida = N\u00e3o existe uma configura\u00e7\u00e3o v\u00e1lida para o sistema!
seguranca.alerta.autenticacao = Usu\u00e1rio ou senha inv\u00e1lidos!
seguranca.alerta.tamanhoMinimoComplex = Tamanho m\u00ednimo permitido 2 caracteres

grupo.alerta.jacad = J\u00e1 Existe um grupo com esta descri\u00e7\u00e3o!

registro.alerta.jaCadComDescricao = J\u00e1 existe um {0} com esta descri\u00e7\u00e3o!
registro.alerta.jaCadComDescricao.fem = J\u00e1 existe uma {0} com esta descri\u00e7\u00e3o!
registro.alerta.naocad = {0} n\u00e3o encontrado!
registro.alerta.naocad.fem = {0} n\u00e3o encontrada!
registro.alerta.naocad2 = Registro n\u00e3o encontrado.
registro.sucesso.exluido = {0} exclu\u00eddo com sucesso!
registro.sucesso.exluida = {0} exclu\u00edda com sucesso!
registro.sucesso.alterado = {0} atualizado com sucesso!
registro.sucesso.alterada = {0} atualizada com sucesso!
registro.sucesso.salvar = {0} salvo com sucesso!
registro.sucesso.salvar.fem = {0} salva com sucesso!
registro.erro.alterar = n\u00e3o foi poss\u00edvel atualizar o {0}! 
registro.erro.alterar.fem = n\u00e3o foi poss\u00edvel atualizar a {0}! 
registro.erro.salvar = Erro ao salvar {0}!
registro.erro.listar = Erro ao listar {0}!
registro.erro.buscar = Erro ao buscar {0}!
registro.erro.excluir = Erro ao excluir {0}!
registro.erro.validar = Erro ao validar {0}!
registro.erro.excluir.generico = Erro ao excluir!
registro.erro.qdt = Erro ao buscar a quantidade de registros de {0}.
registro.alerta.jaCad = {0} j\u00e1 cadastrado!
registro.alerta.jaCad.fem = {0} j\u00e1 cadastrada!

operacao.alerta.naoRealizada = Opera\u00e7\u00e3o n\u00e3o realizada.

alerta.campo.obrigatorio = O campo {0} \u00e9 obrigat\u00f3rio!

#retornos genericos erro rest
rest.erro.salvar = N\u00e3o foi poss\u00edvel salvar o registro! 
rest.erro.listar = N\u00e3o foi poss\u00edvel listar os registros! 
rest.erro.excluir = N\u00e3o foi poss\u00edvel excluir o registro! 
rest.erro.buscar = N\u00e3o foi poss\u00edvel localizar o registro! 
rest.erro.atualizar = N\u00e3o foi poss\u00edvel atualizar o registro! 
rest.erro.qtd = N\u00e3o foi poss\u00edvel calcular o m\u00e1ximo de registros!
rest.sucesso = Comando executado com sucesso!

#retorno genericos sucesso rest
rest.sucesso.salvar = Registro salvo com sucesso!
rest.sucesso.excluir =  Registro exclu\u00eddo com sucesso!



#retornos DAO
dao.erro.salvar = N\u00e3o foi poss\u00edvel salvar o registro! 
dao.erro.listar = N\u00e3o foi poss\u00edvel listar os registros! 
dao.erro.excluir = N\u00e3o foi poss\u00edvel excluir o registro! 
dao.erro.buscar = N\u00e3o foi poss\u00edvel localizar o registro! 
dao.erro.atualizar = N\u00e3o foi poss\u00edvel atualizar o registro! 
dao.erro.qtd = N\u00e3o foi poss\u00edvel calcular a quantidade m\u00e1xima de registros!


#nomes entidades
entidade.Grupo = grupo
entidade.Operador = operador
entidade.Auditoria = auditoria
entidade.Cargo = cargo
entidade.Modulo = modulo
entidade.ModuloGrupo = grupo de acesso


#n\u00e3o autorizado
request.naoAutorizado = Acesso negado!


#cargo
cargo.alerta.naoCad = Cargo n\u00e3o cadastrado!

#funcionarioCargo
funcioanriocargo.alerta.alteracao.atual = Somente \u00e9 poss\u00edvel a altera\u00e7\u00e3o do campo atual.

#grupo
grupo.alerta.excluirAdmin = N\u00e3o \u00e9 poss\u00edvel excluir o Grupo Administrador! 
grupo.alerta.alterarAdmin = N\u00e3o \u00e9 poss\u00edvel alterar o Grupo Administrador!
grupo.alerta.ecluirComOperador = N\u00e3o foi poss\u00edvel excluir, pois o grupo possui operadores vinculados!
grupo.alerta.nenhumGrupoExcluido = N\u00e3o foi poss\u00edvel realizar a exclus\u00e3o de nenhum grupo, pois j\u00e1 existem v\u00ednculos com outros registros.
grupo.alerta.algunsGrupoExcluido =  N\u00e3o foi poss\u00edvel realizar a exclus\u00e3o do(s) grupo(s) selecionado(s), pois j\u00e1 existem v\u00ednculos com outros registros.
grupo.alerta.usoSistema = Este grupo n\u00e3o pode ser cadastrado, pois \u00e9 utilizando internamente pelo sistema!
#rep
rep.alerta.serieJaCad = N\u00famero de s\u00e9rie j\u00e1 cadastrado para a empresa selecionada.
rep.alerta.numRepJaCad = N\u00famero do Rep j\u00e1 cadastrado.
rep.alerta.numSerieInvalido = N\u00famero de s\u00e9rie inv\u00e1lido.
rep.alerta.numfabricanteInvalido = N\u00famero do fabricante inv\u00e1lido.
rep.alerta.codigoModeloInvalido = C\u00f3digo do modelo inv\u00e1lido.
rep.alerta.excluir.possui.marcacao = N\u00e3o foi poss\u00edvel excluir o equipamento, pois existem marca\u00e7\u00f5es vinculadas.

#departamento
departamento.alerta.descricaoJaCad = J\u00e1 existe um departamento com esta descri\u00e7\u00e3o
departamento.alerta.descricaoObrigatoria = Campo descri\u00e7\u00e3o \u00e9 obrigat\u00f3rio
departamento.alerta.funcionario.vinculado = N\u00e3o \u00e9 poss\u00edvel excluir este departamento, pois o mesmo encontra-se vinculado a um ou mais funcion\u00e1rios. Para exclu\u00ed-lo, primeiro desvincule o departamento em quest\u00e3o desse(s) funcion\u00e1rio(s).
departamento.alerta.fechamento = Existe um fechamento de horas cadastrado na data selecionada. Contate o administrador do sistema
departamento.alerta.empresaObrigatoria = N\u00e3o \u00e9 permitido cadastrar um departamento sem empresa.

#Feriado
feriado.alerta.descricaoJaCad = J\u00e1 existe um feriado com esta descri\u00e7\u00e3o.
feriado.alerta.emUso = N\u00e3o foi poss\u00edvel excluir este feriado, pois j\u00e1 encontra-se vinculado a algum calend\u00e1rio.

#Calendario
calendario.alerta.descricaoJaCad = J\u00e1 existe um calend\u00e1rio com esta descri\u00e7\u00e3o
calendario.alerta.naoExcluir = N\u00e3o \u00e9 poss\u00edvel excluir este calend\u00e1rio, pois est\u00e1 sendo utilizado por algum funcion\u00e1rio. Para exclu\u00ed-lo, primeiro o exclua dos funcion\u00e1rios que o utilizam
calendario.alerta.periodoJaCadastrado = As datas do(s) feriado(s) em destaque j\u00e1 est\u00e3o sendo utilizadas.
calendario.alerta.validacao.sucesso = Calend\u00e1rio validado com sucesso
calendario.alerta.maxCopiar = Somente cinco calend\u00e1rios podem ser copiados simultaneamente.
#Cei
cei.alerta.invalido = N\u00famero de CEI inv\u00e1lido.
cei.alerta.jaCadastrado = J\u00e1 existe uma empresa cadastrada com esse CEI!
cei.alerta.possuiVinculos.rep = N\u00e3o foi poss\u00edvel realizar a exclus\u00e3o, pois existe um ou mais REPs cadastrados para este CEI.
cei.alerta.possuiVinculos.funcionario = N\u00e3o foi poss\u00edvel realizar a exclus\u00e3o, pois existe um ou mais funcion\u00e1rios cadastrados para este CEI.
cei.alerta.empresaObrigatoria = N\u00e3o \u00e9 permitido cadastrar um CEI, sem empresa.
#empresa
empresa.alerta.cnpjJaCadastrado = J\u00e1 existe uma empresa cadastrada com esse CNPJ!
empresa.alerta.cpfJaCadastrado = J\u00e1 existe uma empresa cadastrada com esse CPF!
empresa.alerta.possuiVinculo = N\u00e3o foi poss\u00edvel excluir esta empresa, pois j\u00e1 existem v\u00ednculos com outros registros.
empresa.alerta.vinculoPlano =  N\u00e3o foi poss\u00edvel excluir esta empresa, pois o plano est\u00e1 vinculado a mesma.
empresa.alerta.viculoFechamento = N\u00e3o foi poss\u00edvel realizar a opera\u00e7\u00e3o desejada pois existe um fechamento de horas cadastrado. Deve-se primeiro desfazer esse fechamento para realizar essa opera\u00e7\u00e3o.
empresa.alerta.viculoFechamentoEmAndamento = N\u00e3o foi poss\u00edvel realizar a opera\u00e7\u00e3o desejada pois existe um fechamento de horas em andamento.
empresa.alerta.vinculoFuncionario = N\u00e3o \u00e9 poss\u00edvel excluir esta empresa, pois a mesma encontra-se vinculada a um ou mais funcion\u00e1rios. Para exclu\u00ed-la, primeiro desvincule a empresa em quest\u00e3o desse(s) funcion\u00e1rio(s).
empresa.alerta.vinculoFuncionarios = N\u00e3o \u00e9 poss\u00edvel excluir esta empresa, pois ela encontra-se vinculada a um ou mais funcion\u00e1rios. Para exclu\u00ed-la, primeiro desvincule a empresa desse(s) funcion\u00e1rio(s).
empresa.alerta.vinculoDsr = N\u00e3o foi poss\u00edvel realizar a opera\u00e7\u00e3o, pois a empresa possui v\u00ednculos com algum DSR.
empresa.alerta.vinculoRep = N\u00e3o foi poss\u00edvel realizar a opera\u00e7\u00e3o, pois a empresa possui v\u00ednculos com algum Rep.

#fechamento
fechamento.alerta.empresaSemFuncionario = N\u00e3o existe nenhum funcion\u00e1rio cadastrado. N\u00e3o foi poss\u00edvel concluir o fechamento.
fechamento.alerta.funcionarioBancoHorasAberto = Existem funcion\u00e1rios que possuem um banco de horas configurado no per\u00edodo que compreende o do fechamento e est\u00e3o sem data de t\u00e9rmino. Este fechamento n\u00e3o poder\u00e1 ser conclu\u00eddo. Verificar no Cadastro de Funcion\u00e1rios > Banco de Horas > BHs Cadastrados a configura\u00e7\u00e3o de t\u00e9rmino do BH.
fechamento.alerta.existeFechamento  = N\u00e3o foi poss\u00edvel realizar a opera\u00e7\u00e3o desejada pois existe um fechamento de horas cadastrado na data selecionada. Deve-se primeiro desfazer esse fechamento para realizar essa opera\u00e7\u00e3o.
fechamento.alerta.existeFechamentoCadastro  = N\u00e3o foi poss\u00edvel realizar a opera\u00e7\u00e3o desejada pois existe um fechamento de horas com este cadastro. Deve-se primeiro desfazer esse fechamento para realizar essa opera\u00e7\u00e3o.



#Dsr
dsr.alerta.invalido = DSR inv\u00e1lido
dsr.alerta.jaCadastrado = DSR j\u00e1 cadastrado

#Percentuais de acrescimo

percentuais.alerta.invalido = 
percentuais.alerta.jaCadastrado = 
percentuais.alerta.existeVinculo = N\u00e3o foi possivel realizar a exclus\u00e3o, pois o percentual de acr\u00e9scimo possui v\u00ednculos com outros registros.
percentuais.alerta.maximo.copiar = Somente cinco grupos de percentuais de acr\u00e9scimos podem ser copiados simultaneamente.

#Sequencia de percentuais

sequencia_percentuais.alerta.invalido
sequencia_percentuais.alerta.jaCadastrado
sequencia.alerta.percentuais.obrigatorio = Adicione uma sequ\u00eancia

#Banco de Horas

bancohoras.alerta.descricaoJaCad = J\u00e1 existe um banco de horas com esta descri\u00e7\u00e3o!
bancohoras.alerta.naoExcluir = N\u00e3o \u00e9 poss\u00edvel excluir este banco de horas, pois o mesmo encontra-se vinculado a um ou mais funcion\u00e1rios. Para exclu\u00ed-lo, primeiro desvincule o banco de horas em quest\u00e3o desse(s) funcion\u00e1rio(s).
bancohoras.alerta.existeFechamento = N\u00e3o foi poss\u00edvel realizar a opera\u00e7\u00e3o desejada pois existe um fechamento de horas cadastrado na data selecionada. Deve-se primeiro desfazer esse fechamento para realizar essa opera\u00e7\u00e3o
bancohoras.alerta.mensalPercentual = Para utilizar o banco de horas do tipo "Mensal" \u00e9 obrigat\u00f3rio selecionar um grupo de percentuais de acr\u00e9scimos.

#Motivo
motivo.alerta.descricaoJaCad = J\u00e1 existe um motivo com esta descri\u00e7\u00e3o!
motivo.alerta.excluirAbono = N\u00e3o \u00e9 poss\u00edvel alterar este motivo porque est\u00e1 sendo utilizado em evento de exporta\u00e7\u00e3o cadastrado no sistema. Para alter\u00e1-lo, primeiro o exclua do evento de exporta\u00e7\u00e3o onde est\u00e1 sendo utilizado.
motivo.alerta.excluirmarcacao = N\u00e3o \u00e9 poss\u00edvel excluir este motivo porque est\u00e1 sendo utilizado em uma marca\u00e7\u00e3o cadastrada no sistema. Para exclu\u00ed-lo, primeiro o exclua da marca\u00e7\u00e3o onde est\u00e1 sendo utilizado.
motivo.alerta.alterarAbovo = N\u00e3o \u00e9 poss\u00edvel alterar este motivo porque est\u00e1 sendo utilizado em evento de exporta\u00e7\u00e3o cadastrado no sistema. Para alter\u00e1-lo, primeiro o exclua do evento de exporta\u00e7\u00e3o onde est\u00e1 sendo utilizado.
motivo.alerta.alterarCartao = N\u00e3o \u00e9 poss\u00edvel alterar este motivo porque est\u00e1 sendo utilizado em um cart\u00e3o
motivo.alerta.excluirCartao = N\u00e3o \u00e9 poss\u00edvel excluir este motivo porque est\u00e1 sendo utilizado em um cart\u00e3o
motivo.alerta.excluirafastamento =  N\u00e3o \u00e9 poss\u00edvel excluir este motivo porque est\u00e1 sendo utilizado em um afastamento
motivo.alerta.excluirCompensacao =  N\u00e3o \u00e9 poss\u00edvel excluir este motivo porque est\u00e1 sendo utilizado em uma compensa\u00e7\u00e3o
motivo.alerta.alteracaoCompensacao =  N\u00e3o \u00e9 poss\u00edvel alterar este motivo porque est\u00e1 sendo utilizado em uma compensa\u00e7\u00e3o

#cartao

cartao.alerta.emUso = Este n\u00famero de cart\u00e3o j\u00e1 esta em uso no mesmo per\u00edodo.
cartao.alerta.dataInicioAnteriorAdmissao = N\u00e3o \u00e9 permitido cadastrar um cart\u00e3o com a data inicial anterior \u00e0 data de admiss\u00e3o do funcion\u00e1rio!
cartao.alerta.jaPossuiEstaDataInicio = O funcion\u00e1rio j\u00e1 possui um cart\u00e3o com esta data de in\u00edcio.
cartao.alerta.dataInicioPosterioDemissao = N\u00e3o \u00e9 permitido cadastrar um cart\u00e3o com a data inicial posterior \u00e0 data de demiss\u00e3o do funcion\u00e1rio!
cartao.alerta.problema.ao.buscar = N\u00e3o foi poss\u00edvel efetuar a busca do cart\u00e3o.


#planos

planos.alerta.limiteOperador = N\u00famero de operadores excedeu o limite do plano contratado de {0} operadores. 
planos.alerta.planoInvalido = N\u00e3o existe um plano v\u00e1lido

#funcionario
funcionario.alerta.naoCad = Funcion\u00e1rio n\u00e3o cadastrado!
funcionario.alerta.pisJaCad = J\u00e1 existe um funcion\u00e1rio cadastrado com este PIS.
funcionario.alerta.dataInicialAnterioAdmissao = N\u00e3o \u00e9 permitido cadastrar {0} com a data inicial anterior \u00e0 data de admiss\u00e3o do funcion\u00e1rio!
funcionario.alerta.dataFinalAnterioAdmissao = N\u00e3o \u00e9 permitido cadastrar {0} com a data final anterior \u00e0 data de admiss\u00e3o do funcion\u00e1rio!
funcionario.alerta.dataCompensadaAnterioAdmissao = N\u00e3o \u00e9 permitido cadastrar {0} com a data compensada anterior \u00e0 data de admiss\u00e3o do funcion\u00e1rio!
funcionario.alerta.dataInicialPosterioDemissao = N\u00e3o \u00e9 permitido cadastrar {0} com a data inicial posterior \u00e0 data de demiss\u00e3o do funcion\u00e1rio!
funcionario.alerta.dataFinalPosterioDemissao = N\u00e3o \u00e9 permitido cadastrar {0} com a data final posterior \u00e0 data de demiss\u00e3o do funcion\u00e1rio!
funcionario.alerta.dataCompensadaPosterioDemissao = N\u00e3o \u00e9 permitido cadastrar {0} com a data compensada posterior \u00e0 data de demiss\u00e3o do funcion\u00e1rio!
funcionario.alerta.dataInicioMaiorDataFim =  Data inicial maior que data final.
funcionario.alerta.pisInvalido = Pis inv\u00e1lido!
funcionario.alerta.funcionario.uso = N\u00e3o \u00e9 poss\u00edvel excluir este cargo, pois o mesmo encontra-se vinculado a um ou mais funcion\u00e1rios. Para exclu\u00ed-lo, primeiro desvincule o cargo em quest\u00e3o desse(s) funcion\u00e1rio(s).
funcionario.alerta.vinculoOperador = N\u00e3o foi poss\u00edvel excluir este funcion\u00e1rio, pois est\u00e1 vinculado a um operador. Remova o v\u00ednculo do operador primeiro para efetuar a exclus\u00e3o.
funcionario.alerta.excluir.possuiFechamento = N\u00e3o foi poss\u00edvel excluir este funcion\u00e1rio, pois possui fechamentos.
funcionario.alerta.excluir.possuiMarcacoes = N\u00e3o foi poss\u00edvel excluir este funcion\u00e1rio, pois possui marca\u00e7\u00f5es.

funcionario.alerta.dataCartaoAnteriorAdmissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de admiss\u00e3o do funcion\u00e1rio, pois existe um ou mais cart\u00f5es cadastrados para este funcion\u00e1rio com a data de in\u00edcio anterior \u00e0 de admiss\u00e3o.
#funcionario.alerta.dataCartaoPosteriordemissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de demiss\u00e3o do funcion\u00e1rio para esta data, pois existem cart\u00f5es cadastrados para o funcion\u00e1rio com a data de in\u00edcio posterior a esta data.

funcionario.alerta.dataJornadaAnteriorAdmissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de admiss\u00e3o do funcion\u00e1rio, pois existe uma ou mais jornadas cadastradas para este funcion\u00e1rio com a data de in\u00edcio anterior \u00e0 de admiss\u00e3o.
#funcionario.alerta.dataJornadaPosteriordemissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de demiss\u00e3o do funcion\u00e1rio para esta data, pois existem jornadas cadastradas para o funcion\u00e1rio com a data de in\u00edcio posterior a esta data.

funcionario.alerta.dataCalendarioAnteriorAdmissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de admiss\u00e3o do funcion\u00e1rio, pois existe um ou mais calend\u00e1rios cadastrados para este funcion\u00e1rio com a data de in\u00edcio anterior \u00e0 de admiss\u00e3o.
#funcionario.alerta.dataCalendarioPosteriordemissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de demiss\u00e3o do funcion\u00e1rio para esta data, pois existem calend\u00e1rios cadastrados para o funcion\u00e1rio com a data de in\u00edcio posterior a esta data.

funcionario.alerta.dataAfastamentoAnteriorAdmissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de admiss\u00e3o do funcion\u00e1rio, pois existe um ou mais afastamentos cadastrados para este funcion\u00e1rio com a data de in\u00edcio anterior \u00e0 de admiss\u00e3o.
#funcionario.alerta.dataAfastamentoPosteriordemissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de demiss\u00e3o do funcion\u00e1rio para esta data, pois existem afastamentos cadastrados para o funcion\u00e1rio com a data de in\u00edcio posterior a esta data.

funcionario.alerta.dataCompensacaoAnteriorAdmissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de admiss\u00e3o do funcion\u00e1rio, pois existe umm ou mais compensa\u00e7\u00f5es cadastradas para este funcion\u00e1rio com a data de in\u00edcio anterior \u00e0 de admiss\u00e3o.
#funcionario.alerta.dataCompensacaoPosteriordemissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de demiss\u00e3o do funcion\u00e1rio para esta data, pois existem compensa\u00e7\u00f5es cadastradas para o funcion\u00e1rio com a data de in\u00edcio posterior a esta data.

funcionario.alerta.dataBHManutencaoAnteriorAdmissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de admiss\u00e3o do funcion\u00e1rio, pois existe um ou mais bancos de horas cadastrados para este funcion\u00e1rio com a data de in\u00edcio anterior \u00e0 de admiss\u00e3o.
#funcionario.alerta.dataBHManutencaoPosteriordemissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de demiss\u00e3o do funcion\u00e1rio para esta data, pois existem banco de horas cadastrados para o funcion\u00e1rio com a data de in\u00edcio posterior a esta data.

funcionario.alerta.dataBHFechamentoAnteriorAdmissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de admiss\u00e3o do funcion\u00e1rio, pois existe uma ou mais fechamento de banco de horas cadastrados para este funcion\u00e1rio com a data de in\u00edcio anterior \u00e0 de admiss\u00e3o.
#funcionario.alerta.dataBHFechamentoPosteriordemissao = N\u00e3o \u00e9 poss\u00edvel alterar a data de demiss\u00e3o do funcion\u00e1rio para esta data, pois existem fechamentos cadastrados para o funcion\u00e1rio com a data de in\u00edcio posterior a esta data.


#funcionario jornada
funcionarioJornada.alerta.jaPossuiEstaDataInicio = J\u00e1 existe outra jornada cadastrada para esse funcion\u00e1rio com essa data inicial!
funcionarioJornada.alerta.excecao.periodoInvalido = Per\u00edodo inv\u00e1lido para a exce\u00e7\u00e3o de jornada!
funcionarioJornada.alerta.excecao.jornadaNaoCad = N\u00e3o existe nenhuma jornada cadastrada no per\u00edodo em que ser\u00e1 cadastrada a exce\u00e7\u00e3o!
funcionarioJornada.alerta.dataInicioMenorDataFim = A data de inicio da jornada deve ser maior que a data de t\u00e9rmino da jornada.
funcionarioJornada.alerta.excecao.periodoJaCadastrado = J\u00e1 existe uma exce\u00e7\u00e3o cadastrada para este periodo.
funcionarioJornada.alerta.excecao.excluir = N\u00e3o \u00e9 poss\u00edvel efetuar a exclus\u00e3o, pois existe uma exce\u00e7\u00e3o de jornada cadastrada no per\u00edodo desta jornada.
funcionarioJornada.alerta.entreJornada =  N\u00e3o \u00e9 poss\u00edvel vincular esta jornada para este dia, pois existem hor\u00e1rios que est\u00e3o se sobrepondo. Revise as jornadas cadastradas.
funcionarioJornada.alerta.generoEntidade = uma jornada
funcionarioJornada.alerta.campoSequenciaInicial = Sequ\u00eancia inicial

#funcionario calendario

funcionarioCalendario.alerta.jaPossuiEstaDataInicio = N\u00e3o \u00e9 permitido cadastrar mais de um calend\u00e1rio com a mesma data inicial!
funcionarioCalendario.alerta.generoEntidade = um calend\u00e1rio

#funcionario afastamento

funcionarioAfastamento.alerta.dataInicioPosteriorRetorno = A data de in\u00edcio deve ser menor que a data t\u00e9rmino!
funcionarioAfastamento.alerta.mesmoPeriodo =  O per\u00edodo selecionado coincide com outro per\u00edodo de afastamento cadastrado para o funcion\u00e1rio.
funcionarioAfastamento.alerta.periodoObrigatorio = Selecione um per\u00edodo v\u00e1lido.
funcionarioAfastamento.alerta.generoEntidade = um afastamento

#funcioanrio compensacao

funcionarioCompensacao.alerta.jaExisteUmaDataDentroDoPeriodo = J\u00e1 existe uma data para ser compensada dentro do per\u00edodo de compensa\u00e7\u00e3o informado!
funcioanrioCompensacao.alerta.dataInicialPosteriorDataFinal = A data inicial n\u00e3o deve ser posterior \u00e0 data final!
funcionarioCompensacao.alerta.dataCompensadaDentroPeriodoCompensacao = A data a ser compensada n\u00e3o pode estar dentro do per\u00edodo de compensa\u00e7\u00e3o!
funcionarioCompensacao.alerta.data.compesada.jaCadastrada = J\u00e1 existe uma compensa\u00e7\u00e3o cadastrada para esta data!
funcionarioCompensacao.alerta.periodoJaCadastrado = O per\u00edodo selecionado coincide com outro per\u00edodo de compensa\u00e7\u00e3o cadastrado para o funcion\u00e1rio.
funcionarioCompensacao.alerta.generoEntidade = uma compensa\u00e7\u00e3o

#funcionario banco de horas

funcionarioBancoHoras.alerta.periodoInvalido = Per\u00edodo inv\u00e1lido.
funcionarioBancoHoras.alerta.periodoJaCadastrado = N\u00e3o \u00e9 poss\u00edvel efetuar o cadastro porque o per\u00edodo coincide com outro per\u00edodo de banco de horas cadastrado para o funcion\u00e1rio.
funcionarioBancoHoras.alerta.dataInicioPosteriorEstaData = Existe um banco de horas com a data de in\u00edcio posterior a esta data. Portanto, a data final do banco de horas n\u00e3o poder\u00e1 ficar em aberto.
funcionarioBancoHoras.alerta.subtotais = ATEN\u00c7\u00c3O: Todos os subtotais e edi\u00e7\u00f5es de saldo que n\u00e3o sem enquadrarem no per\u00edodo de algum banco de horas ser\u00e3o exclu\u00eddos.
funcionarioBancoHoras.alerta.recalcularSubtotais = Os subtotais posteriores ao in\u00edcio deste banco de horas ser\u00e3o recalculados. Confirma os dados desse banco de horas?
funcionarioBancoHoras.alerta.dataInicialJaCadastrada = Data inicla j\u00e1 cadastrada.
funcionarioBancoHoras.alerta.dataFinal.maximo = A data final deve ser no anterior a data de inicio pr\u00f3ximo banco de horas.
funcionarioBancoHoras.alerta.exclusao.NaoPermitida = N\u00e3o \u00e9 poss\u00edvel efetuar a exclus\u00e3o, pois existem bancos de horas posteriores a este. Para efetuar a exclus\u00e3o, \u00e9 necess\u00e1rio que os bancos de horas posteriores sejam exclu\u00eddos primeiro.
funcionarioBancoHoras.alerta.bancoAberto = Existe um banco de horas em aberto. Necess\u00e1rio incluir uma data final para esse banco de horas antes que um novo seja cadastrado.
funcionarioBancoHoras.alerta.generoEntidade = um banco de horas
funcionarioBancoHoras.alerta.fechamentoBH = N\u00e3o \u00e9 poss\u00edvel realizar a opera\u00e7\u00e3o para este banco de horas pois existem fechamentos de B.H cadastrados, exclua-os primeiro.

funcionarioBancoHoras.alerta.excluirSubtotal = Este subtotal n\u00e3o pode ser exclu\u00eddo, pois ele marca o saldo inicial de um Banco de Horas cadastrado para o funcion\u00e1rio. Para exclu\u00ed-lo, \u00e9 necess\u00e1rio que o Banco de Horas seja exclu\u00eddo primeiro.
funcionarioBancoHoras.alerta.EditarSubtotal = Este subtotal n\u00e3o pode ser editado, pois ele marca o saldo inicial de um Banco de Horas cadastrado para o funcion\u00e1rio. Para edit\u00e1-lo, \u00e9 necess\u00e1rio que o Banco de Horas seja exclu\u00eddo primeiro.
funcionarioBancoHoras.alerta.bancoDeHorasNaoEncontrado = N\u00e3o existe um banco de horas cadastrado para a data informada.
funcionarioBancoHoras.alerta.gatihoNaoAtingido = O acerto n\u00e3o ser\u00e1 gerado, pois os valores de gatilho informado n\u00e3o for\u00e3o atingidos.
funcionarioBancoHoras.alerta.saldoZerado = O acerto n\u00e3o ser\u00e1 gerado, pois o saldo de banco de horas para a data informada j\u00e1 esta zerado.
funcionarioBancoHoras.alerta.gatilhosZerados = \u00c9 necess\u00e1rio informar algum valor para o gatilho de cr\u00e9dito ou de d\u00e9bito.
funcionarioBancoHoras.alerta.acertoManualZerado = Informe a quantidade de horas  a serem debitadas/creditadas.
funcionarioBancoHoras.alerta.jaPossuiAcerto = J\u00e1 existe um acerto nesta data.
funcionarioBancoHoras.alerta.jaPossuiSubtotal = J\u00e1 existe um Subtotal nesta data.
funcionarioBancoHoras.alerta.jaPossuiEdicaoSaldo = J\u00e1 existe uma edi\u00e7\u00e3o de saldo nesta data.
funcionarioBancoHoras.alerta.jaPossuiFechamento = J\u00e1 existe um fechamento nesta data.
funcionarioBancoHoras.alerta.acertoEdicaoSaldoSubtotalPosterior = N\u00e3o \u00e9 poss\u00edvel realizar a edi\u00e7\u00e3o de saldo para essa data, pois existem subtotais posteriores que marcam o saldo inicial de banco de horas.

#Jornadas

jornada.alerta.semanalQtdDias = Para jornada semanal todos os dias s\u00e3o obrigat\u00f3rios.
jornada.alerta.limiteMaximoHorarios = Limite m\u00e1ximo de hor\u00e1rio atingido.
jornada.alerta.descricaoJaCadastrada = J\u00e1 existe uma jornada cadastrada com esta descri\u00e7\u00e3o.
jornada.alerta.excluir = N\u00e3o \u00e9 poss\u00edvel excluir esta jornada, pois a mesma encontra-se vinculada a um ou mais funcion\u00e1rios. Para exclu\u00ed-la, primeiro desvincule a jornada em quest\u00e3o desse(s) funcion\u00e1rio(s).
jornada.alerta.semHorario = N\u00e3o \u00e9 poss\u00edvel cadastrar jornada sem hor\u00e1rio
jornada.alerta.atualizar = Esta jornada n\u00e3o pode ser editada, pois est\u00e1 sendo utilizada por algum funcion\u00e1rio.
jornada.alerta.vinculoComFuncionario = N\u00e3o \u00e9 poss\u00edvel excluir esta jornada, pois a mesma encontra-se vinculada a um ou mais funcion\u00e1rios. Para exclu\u00ed-la, primeiro desvincule a jornada em quest\u00e3o desse(s) funcion\u00e1rio(s).
jornada.alerta.parametros.max = O valor do percentual de acr\u00e9scimo noturno deve estar compreendido entre 0 e 200!
jornada.alerta.parametros.inicioFim = O in\u00edcio e o fim do per\u00edodo noturno n\u00e3o devem ser iguais!
jornada.alerta.parametros.percentual = Informe o percentual para adicional noturno!
jornada.alerta.horaExtra.diaSemana = Informe o dia da semana para fechamento das horas extras!
jornada.alerta.horaExtra.diaMes = Informe o dia de fechamento para horas extras.
jornada.alerta.horaExtra.diaInvalido = Dia de fechamento inv\u00e1lido.
jornada.alerta.maximo.copiar = A quantidade m\u00e1xima para copiar \u00e9 de 5 jornadas. 


#horario
horario.alerta.descricao.jaCadastrado = J\u00e1 existe um hor\u00e1rio cadastrado com esta descri\u00e7\u00e3o.
horario.alerta.somaHorariosMaiorQue24Horas = As horas do dia excederam 24 horas. Revise os per\u00edodos.
horario.alerta.atualizar = N\u00e3o foi poss\u00edvel atualizar este hor\u00e1rio, pois est\u00e1 sendo utilizado em outras jornadas.
horario.alerta.excluir = N\u00e3o \u00e9 poss\u00edvel excluir este hor\u00e1rio, pois o mesmo encontra-se vinculado a uma ou mais jornadas. Para exclu\u00ed-lo, primeiro desvincule o hor\u00e1rio em quest\u00e3o dessa(s) jornada(s).
horario.alerta.semMarcacao = N\u00e3o \u00e9 permitido cadastrar um hor\u00e1rio sem nenhum per\u00edodo definido!

#horario marcacao
horarioMarcacao.alerta.horaInicialMaiorHoraFinal = A hora de inicial deve ser anterior a hora final.
horarioMarcacao.alerta.periodoJaCadastrado = N\u00e3o \u00e9 poss\u00edvel utilizar esse hor\u00e1rio, pois est\u00e1 sobrepondo o hor\u00e1rio anterior.  

#jornada horario
jornadaHorario.alerta.inicioAnteriorUltimo = N\u00e3o \u00e9 poss\u00edvel utilizar esse hor\u00e1rio, pois est\u00e1 sobrepondo o hor\u00e1rio do dia anterior. 
jornadaHorario.alerta.naoInferior11Horas = Ap\u00f3s cada per\u00edodo de trabalho efetivo, deve haver um intervalo de repouso, n\u00e3o inferior a 11(onze) horas, deseja continuar?
jornadaHorario.alerta.qtdDiasSemanal = Preencha todos os dias da semana
jornadaHorario.alerta.qtdDias = Limite m\u00e1ximo de hor\u00e1rios atingido.
jornadaHorario.alerta.alteracao.naoPermitida = Esse hor\u00e1rio est\u00e1 sendo utilizado em outros dias/jornadas, e sua altera\u00e7\u00e3o infringe as regras, por esse motivo n\u00e3o \u00e9 poss\u00edvel alter\u00e1-lo, ser\u00e1 necess\u00e1rio criar um novo hor\u00e1rio.

#coletivo
coletivo.alerta.excluir = N\u00e3o foi poss\u00edvel realizar a opera\u00e7\u00e3o desejada pois existe um fechamento de horas cadastrado na data selecionada. Deve-se primeiro desfazer esse fechamento para realizar essa opera\u00e7\u00e3o.

#ferramentas
ferramentas.alerta.funcionario.demitido = Funcion\u00e1rio est\u00e1 demitido na data da marca\u00e7\u00e3o.
ferramentas.alerta.marcacao.ja.cadastrada = Marca\u00e7\u00e3o j\u00e1 cadastrada.